Revit 2026 API

# FabricationDimensionUnitType Enumeration

---

Fabrication dimension unit type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FabricationDimensionUnitType
```
```vb
Public Enumeration FabricationDimensionUnitType
```
```cpp
public enum class FabricationDimensionUnitType
```
```fsharp
type FabricationDimensionUnitType
```

| Member name | Value | Description |
| --- | --- | --- |
| Angular | 2 | Angular. |
| Linear | 1 | Linear. |
| NoUnits | 0 | NoUnits. |

#### Reference

Autodesk.Revit.DB Namespace